In [132]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [133]:
#wczytanie danych
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')

In [134]:
#przegląd i informacje o danych
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [135]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [136]:
print(train.shape)
print(test.shape)

(891, 12)
(418, 11)

In [137]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [138]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [139]:
#uzupełnienie brakujących danych

#wiek
median_age = train.Age.median()
train.Age = train.Age.fillna(value=median_age)

In [140]:
#port startowy
mode_embarked = train.Embarked.mode()[0]
train.Embarked = train.Embarked.fillna(value=mode_embarked)

In [141]:
#cena biletu
median_fare = train.Fare.median()
train.Fare = train.Fare.fillna(value=median_fare)

In [142]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       891 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [143]:
#formatowanie danych

#zamiana zmiennej kategoryjnej płeć na 0 dla mężczyzn i 1 dla kobiet
train['Sex'] = np.where(train['Sex'] == 'male',0,train['Sex'])
train['Sex'] = np.where(train['Sex'] == 'female',1,train['Sex'])

#zamiana zmiennej kategoryjnej port startowy na 0, 1, 2
train['Embarked'] = np.where(train['Embarked'] == 'S',0,train['Embarked'])
train['Embarked'] = np.where(train['Embarked'] == 'C',1,train['Embarked'])
train['Embarked'] = np.where(train['Embarked'] == 'Q',2,train['Embarked'])

In [144]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,1
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,0
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,0

In [145]:
#typy zmienionych danych i ich zmiana na int

train['Sex'].unique()

array([0, 1], dtype=object)

In [146]:
train['Sex']=train['Sex'].astype('int')
train['Sex'].unique()

array([0, 1], dtype=int64)

In [147]:
train['Embarked'].unique()

array([0, 1, 2], dtype=object)

In [148]:
train['Sex']=train['Sex'].astype('int')
train['Sex'].unique()

array([0, 1], dtype=int64)

In [149]:
#określenie targetu i istotnych zmiennych
y = train.Survived
X = train[['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked']]

In [150]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.3)

In [151]:
#regresja logistyczna

from sklearn.linear_model import LogisticRegression
logreg=LogisticRegression()
logreg.fit(X_train, y_train)
logreg_y_pred = logreg.predict (X_test)
accuracy = logreg.score(X_test, y_test)
print('Regresja logistyczna: ',accuracy)

Regresja logistyczna:  0.8059701492537313

In [152]:
#drzewo decyzyjne

from sklearn.tree import DecisionTreeClassifier
dectree = DecisionTreeClassifier()
dectree.fit(X_train , y_train)
dectree_y_pred = dectree.predict(X_test)
accuracy = dectree.score(X_test, y_test)
print('Drzewo decyzyjne: ',accuracy)

Drzewo decyzyjne:  0.7761194029850746

In [153]:
#lasy losowe

from sklearn.ensemble import RandomForestClassifier
ranfor = RandomForestClassifier(n_estimators = 100)
ranfor.fit(X_train, y_train)
ranfor_y_pred = ranfor.predict(X_test)
accuracy = ranfor.score(X_test, y_test)
print('Lasy losowe: ',accuracy)

Lasy losowe:  0.832089552238806